fundamental_twod_motion/wake_capture_2d_job_pack/Re100.0_stroke7.0_acf0.5_pf0.125/backGround/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboverset.so");

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         14;

deltaT          2e-3;

writeControl    adjustableRunTime;

writeInterval   1e-2;

purgeWrite      1;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;
/*
adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       0.01;
*/
// ************************************************************************* //

functions
{
#include "FOforceCoefficients"
};


